# First examples of Series and Data Frames usings

In [2]:
import pandas as pd

In [3]:
ages = [22,13,8,33,25,44,38,22]

_Create a serie object from ages list, then print it_

In [4]:
age_serie = pd.Series(ages)
age_serie

0    22
1    13
2     8
3    33
4    25
5    44
6    38
7    22
dtype: int64

_Using `head()`, print the first five records of `age_serie`_

In [5]:
age_serie.head()

0    22
1    13
2     8
3    33
4    25
dtype: int64

***Notice if we don't introduce an argument for head, python shows us the first five records**

_Now print the last three records of `age_serie`_

In [6]:
age_serie.tail(3)

5    44
6    38
7    22
dtype: int64

_Calculate mean, max and min of `age_serie`_

In [7]:
min__age = age_serie.min()
max_age = age_serie.max()
mean_age = age_serie.mean()
resume_age = [min__age,max_age,mean_age] 
print(f'min, max and average age is {resume_age}, respectivly')

min, max and average age is [np.int64(8), np.int64(44), np.float64(25.625)], respectivly

***Notice python returns us all three messures like `np.float64 or np.int64` since pandas delagates that job to numpy librarie**

_Get the second value of `age_serie`_

In [8]:
age_serie[1]

np.int64(13)

***Also we can use `get()`**

In [9]:
age_serie.get(1)

np.int64(13)

_Get the records have the value 22_

In [10]:
filter = age_serie == 22
filter

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [11]:
age_serie[filter]

0    22
7    22
dtype: int64

_Take `ages2`, make a Serie and sum it with `ages_serie`, is there some difference regarding sum lists `ages` and `ages2`_

In [12]:
ages2 = [23,15,12,25,20,50,31,2]
age_serie2 = pd.Series(ages2)

In [13]:
age_serie + age_serie2

0    45
1    28
2    20
3    58
4    45
5    94
6    69
7    24
dtype: int64

In [14]:
ages + ages2

[22, 13, 8, 33, 25, 44, 38, 22, 23, 15, 12, 25, 20, 50, 31, 2]

_what happens if we have two series with different number of elements?_

In [15]:
age3 = [31]
age_serie3 = pd.Series(age3)
age_serie2 + age_serie3

0    54.0
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
dtype: float64

***Notice to sum series is actually sum element by element, besides sum lists is create a new list with all the elements the previous lists have**

_First sort `age_serie2`, the sum it with `age_serie`_

In [16]:
age_serie2 = age_serie2.sort_index(ascending=False)
age_serie2

7     2
6    31
5    50
4    20
3    25
2    12
1    15
0    23
dtype: int64

In [17]:
age_serie + age_serie2

0    45
1    28
2    20
3    58
4    45
5    94
6    69
7    24
dtype: int64

***Notice the element by element sum is in function the index but isn't by the element relative position**

_Sume to `age_serie` five unids, also multiply original `age serie` by 2_

In [18]:
age_serie - 5

0    17
1     8
2     3
3    28
4    20
5    39
6    33
7    17
dtype: int64

In [19]:
age_serie * 2

0    44
1    26
2    16
3    66
4    50
5    88
6    76
7    44
dtype: int64

_First, define some function for calculate the second power of a `number`, then use `map()` for apply to some Serie_

In [20]:
def sq(number):
    return number**2

In [21]:
age_serie.map(sq)

0     484
1     169
2      64
3    1089
4     625
5    1936
6    1444
7     484
dtype: int64

_Craft a `DataFrame` object from the `data` variable, then print the first three elements_

In [22]:
data = {  
        "nombre":["Argentina","Brasil","Chile","Colombia","Ecuador","Paraguay","Peru"],  
        "capital":["Buenos Airea","Brasilia","Santiago de Chile","Bogotá","Quito","Asunción","Lima"],  
        "poblacion":[45380000,212600000,19120000,50880000,17640000,7133000,32970000],
        "sup. en km2":[2780000,8516000,756950,1143000,283560,406752,1285216]
}

In [23]:
countries = pd.DataFrame(data)
countries

      nombre            capital  poblacion  sup. en km2
0  Argentina       Buenos Airea   45380000      2780000
1     Brasil           Brasilia  212600000      8516000
2      Chile  Santiago de Chile   19120000       756950
3   Colombia             Bogotá   50880000      1143000
4    Ecuador              Quito   17640000       283560
5   Paraguay           Asunción    7133000       406752
6       Peru               Lima   32970000      1285216

In [24]:
countries.head(3)

      nombre            capital  poblacion  sup. en km2
0  Argentina       Buenos Airea   45380000      2780000
1     Brasil           Brasilia  212600000      8516000
2      Chile  Santiago de Chile   19120000       756950

_First make a new DataFrame including only two columns: `counstry name` and `population`, later switch `country name` like a index and create a new DataFrame with columns `population` and `surface area`. What happens if you use `counstries` DataFrame instead of `data` in the second exercise? Where that `NaN's` appeared from?_

In [25]:
countries_clean = pd.DataFrame(countries, columns=['nombre','poblacion'])
countries_clean

      nombre  poblacion
0  Argentina   45380000
1     Brasil  212600000
2      Chile   19120000
3   Colombia   50880000
4    Ecuador   17640000
5   Paraguay    7133000
6       Peru   32970000

In [31]:
countries_clean = pd.DataFrame(
    countries, 
    index = countries['nombre'], 
    columns = [
        'poblacion', 
        'sup. en km2'
    ]
)

countries_clean

           poblacion  sup. en km2
nombre
Argentina        NaN          NaN
Brasil           NaN          NaN
Chile            NaN          NaN
Colombia         NaN          NaN
Ecuador          NaN          NaN
Paraguay         NaN          NaN
Peru             NaN          NaN

In [33]:
countries_clean = pd.DataFrame(
    data, 
    index=data['nombre'], 
    columns = [
        'poblacion', 
        'sup. en km2'
    ]
)
countries_clean

           poblacion  sup. en km2
Argentina   45380000      2780000
Brasil     212600000      8516000
Chile       19120000       756950
Colombia    50880000      1143000
Ecuador     17640000       283560
Paraguay     7133000       406752
Peru        32970000      1285216

***Notice if we use a DataFrame for reindex any other the NaN errors appears, so in this case is better to use the original dic to craft from the beggining the new DataFrame**

_Using `loc` filt by index `countries_clean`, trying with `Argentina`. Make a new DataFrame about `Argentina` and `Brasil` and their population. Finally, make a filter which show us a DataFrame with the countries have more than 1,000,0000 square km in surface_

In [34]:
countries_clean.loc["Argentina"]

poblacion      45380000
sup. en km2     2780000
Name: Argentina, dtype: int64

In [36]:
countries_clean.loc[["Argentina","Brasil"],["poblacion"]]

           poblacion
Argentina   45380000
Brasil     212600000

In [37]:
countries_clean.loc[countries_clean["sup. en km2"] > 1000000]

           poblacion  sup. en km2
Argentina   45380000      2780000
Brasil     212600000      8516000
Colombia    50880000      1143000
Peru        32970000      1285216

***Notice, there are some more way of how filt a DataFrame, but the output would be a Serie intead of DataFrame. Examples:**